package Tasks;

import java.util.Scanner;

public class Problem4 {
    public String start() {
        String lesson = " «Угадайка»: Грають двоє учасників. Перший загадує будь тризначне число, таке що перша і остання цифри відрізняються" +
                " \nодин від одного більш ніж на одиницю. Далі загадав число гравець перевертає загадане число, змінюючи" +
                " першу і останню цифри місцями, таким чином отримуючи ще одне число. Потім з максимального " +
                "\nз отриманих двох чисел віднімається мінімальне. Завдання другого гравця - вгадати по першій цифрі " +
                "отриманого в результаті віднімання числа саме це число. Наприклад, якщо Вася загадав число 487, " +
                "\nто перестановкою першої і останньої цифри він отримає число 784. Після чого йому доведеться відняти" +
                " від 784 число 487, в результаті чого вийде число 297, яке і має відгадати Петя по зазначеній першій цифрі" +
                " \n«2», взятої з цього числа. Петя встигає краще Васі з математики, тому практично завжди виграє в іграх " +
                "такого типу. Але в даному випадку Петя схитрував і спеціально придумав таку гру, в якій він не програє Васі" +
                "\n в будь-якому випадку. Справа в тому, що придумана Петром гра має виграшну стратегію, " +
                "яка полягає в наступному: шукане число завжди є тризначним і друга його цифра завжди дорівнює дев'яти, " +
                "\nа для отримання значення останньої досить відняти від дев'яти першу, тобто в розглянутому вище " +
                "випадку остання цифра дорівнює 9-2 = 7.";


        int [] array = new int[3];
        Scanner in = new Scanner(System.in);
        System.out.println("Введіть першу цифру");
        array[0] = in.nextInt();
        array[1] = 9;
        array[2] = array[1] - array[0];


 return  String.valueOf(array[0])+(array[1])+(array[2]);
    }
}